[{"title":"NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch","preview":"The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July."},{"title":"The Detective Aboard NASA's Perseverance Rover","preview":"An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."},{"title":"NASA's Perseverance Rover Attached to Atlas V Rocket","preview":"Ready for its launch later in the month, the Mars-bound rover will touch terra firma no more."},{"title":"NASA Engineers Checking InSight's Weather Sensors","preview":"An electronics issue is suspected to be preventing the sensors from sharing their data about Mars weather with the spacecraft."},{"title":"NASA Moves Forward With Campaign to Return Mars Samples to Earth","preview":"During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."},{"title":"Meet the People Behind NASA's Perseverance Rover","preview":"These are the scientists and engineers who built NASA's next Mars rover and who will guide it to a safe landing in Jezero Crater. "},{"title":"Mars Scientists Investigate Ancient Life in Australia","preview":"Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions. "},{"title":"NASA's Mars Helicopter Attached to Mars 2020 Rover ","preview":"The helicopter will be first aircraft to perform flight tests on another planet."},{"title":"NASA's Mars 2020 Heads Into the Test Chamber","preview":"In this time-lapse video taken at JPL, engineers move the Mars 2020 rover into a large vacuum chamber for testing in Mars-like environmental conditions."},{"title":"All About the Laser (and Microphone) Atop Mars 2020, NASA's Next Rover","preview":"SuperCam is a rock-vaporizing instrument that will help scientists hunt for Mars fossils."},{"title":"The Extraordinary Sample-Gathering System of NASA's Perseverance Mars Rover","preview":"Two astronauts collected Moon rocks on Apollo 11. It will take three robotic systems working together to gather up the first Mars rock samples for return to Earth."},{"title":"NASA's Mars 2020 Rover Closer to Getting Its Name","preview":"155 students from across the U.S. have been chosen as semifinalists in NASA's essay contest to name the Mars 2020 rover, and see it launch from Cape Canaveral this July."},{"title":"Join NASA for the Launch of the Mars 2020 Perseverance Rover","preview":"No matter where you live, choose from a menu of activities to join NASA as we \"Countdown to Mars\" and launch the Perseverance rover to the Red Planet."},{"title":"3 Things We've Learned From NASA's Mars InSight ","preview":"Scientists are finding new mysteries since the geophysics mission landed two years ago."},{"title":"NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet","preview":"The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July."}]